experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run2_vclients8_workerthreads64_client3_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      103065 ops,    1477 (avg:    1472) ops/sec, 5.82MB/sec (avg: 5.80MB/sec),  5.43 (avg:  5.43) msec latency

1         Threads
8         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1472.20          ---          ---      5.42900      5941.86 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1472.20         0.00         0.00      5.42900      5941.86 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.790         0.00
SET       0.820         0.00
SET       0.870         0.00
SET       0.900         0.01
SET       0.910         0.01
SET       0.920         0.01
SET       0.930         0.02
SET       0.940         0.03
SET       0.950         0.03
SET       0.960         0.05
SET       0.970         0.06
SET       0.980         0.07
SET       0.990         0.09
SET       1.000         0.27
SET       1.100         1.10
SET       1.200         2.80
SET       1.300         5.30
SET       1.400         8.57
SET       1.500        12.00
SET       1.600        15.14
SET       1.700        18.14
SET       1.800        20.72
SET       1.900        23.01
SET       2.000        24.92
SET       2.100        26.51
SET       2.200        27.84
SET       2.300        29.03
SET       2.400        30.06
SET       2.500        31.00
SET       2.600        31.89
SET       2.700        32.62
SET       2.800        33.26
SET       2.900        33.83
SET       3.000        34.37
SET       3.100        34.85
SET       3.200        35.35
SET       3.300        35.82
SET       3.400        36.24
SET       3.500        36.70
SET       3.600        37.14
SET       3.700        37.57
SET       3.800        38.01
SET       3.900        38.45
SET       4.000        38.86
SET       4.100        39.27
SET       4.200        39.74
SET       4.300        40.20
SET       4.400        40.63
SET       4.500        41.10
SET       4.600        41.61
SET       4.700        42.05
SET       4.800        42.57
SET       4.900        43.10
SET       5.000        43.66
SET       5.100        44.25
SET       5.200        44.89
SET       5.300        45.54
SET       5.400        46.23
SET       5.500        46.96
SET       5.600        47.73
SET       5.700        48.59
SET       5.800        49.48
SET       5.900        50.49
SET       6.000        51.51
SET       6.100        52.60
SET       6.200        53.84
SET       6.300        55.11
SET       6.400        56.45
SET       6.500        57.87
SET       6.600        59.44
SET       6.700        61.07
SET       6.800        62.73
SET       6.900        64.44
SET       7.000        66.17
SET       7.100        67.86
SET       7.200        69.63
SET       7.300        71.36
SET       7.400        73.03
SET       7.500        74.69
SET       7.600        76.21
SET       7.700        77.67
SET       7.800        79.15
SET       7.900        80.53
SET       8.000        81.81
SET       8.100        83.02
SET       8.200        84.16
SET       8.300        85.21
SET       8.400        86.15
SET       8.500        87.05
SET       8.600        87.88
SET       8.700        88.63
SET       8.800        89.35
SET       8.900        90.00
SET       9.000        90.59
SET       9.100        91.10
SET       9.200        91.60
SET       9.300        92.07
SET       9.400        92.45
SET       9.500        92.85
SET       9.600        93.19
SET       9.700        93.50
SET       9.800        93.81
SET       9.900        94.08
SET      10.000        95.34
SET      11.000        96.75
SET      12.000        97.60
SET      13.000        98.31
SET      14.000        98.91
SET      15.000        99.33
SET      16.000        99.58
SET      17.000        99.69
SET      18.000        99.72
SET      19.000        99.74
SET      20.000        99.77
SET      21.000        99.79
SET      22.000        99.81
SET      23.000        99.84
SET      24.000        99.85
SET      25.000        99.87
SET      26.000        99.89
SET      27.000        99.90
SET      28.000        99.90
SET      29.000        99.92
SET      30.000        99.93
SET      31.000        99.94
SET      32.000        99.95
SET      33.000        99.95
SET      34.000        99.96
SET      35.000        99.97
SET      36.000        99.97
SET      38.000        99.97
SET      39.000        99.98
SET      40.000        99.98
SET      42.000        99.98
SET      51.000        99.99
SET      52.000        99.99
SET      53.000        99.99
SET      58.000        99.99
SET      59.000        99.99
SET      64.000        99.99
SET     140.000       100.00
SET     150.000       100.00
---
---