experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients16_workerthreads16_client3_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      155446 ops,    2215 (avg:    2220) ops/sec, 8.73MB/sec (avg: 8.75MB/sec),  7.22 (avg:  7.20) msec latency

1         Threads
16        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2220.56          ---          ---      7.20100      8962.24 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2220.56         0.00         0.00      7.20100      8962.24 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000         0.00
SET       1.100         0.00
SET       1.200         0.01
SET       1.300         0.03
SET       1.400         0.06
SET       1.500         0.10
SET       1.600         0.18
SET       1.700         0.30
SET       1.800         0.44
SET       1.900         0.66
SET       2.000         0.95
SET       2.100         1.37
SET       2.200         1.95
SET       2.300         2.64
SET       2.400         3.41
SET       2.500         4.27
SET       2.600         5.29
SET       2.700         6.37
SET       2.800         7.46
SET       2.900         8.52
SET       3.000         9.67
SET       3.100        10.77
SET       3.200        11.82
SET       3.300        12.87
SET       3.400        13.84
SET       3.500        14.76
SET       3.600        15.69
SET       3.700        16.55
SET       3.800        17.35
SET       3.900        18.11
SET       4.000        18.90
SET       4.100        19.63
SET       4.200        20.37
SET       4.300        21.09
SET       4.400        21.84
SET       4.500        22.57
SET       4.600        23.28
SET       4.700        24.03
SET       4.800        24.79
SET       4.900        25.58
SET       5.000        26.34
SET       5.100        27.13
SET       5.200        27.93
SET       5.300        28.72
SET       5.400        29.59
SET       5.500        30.44
SET       5.600        31.32
SET       5.700        32.21
SET       5.800        33.19
SET       5.900        34.17
SET       6.000        35.22
SET       6.100        36.24
SET       6.200        37.29
SET       6.300        38.42
SET       6.400        39.60
SET       6.500        40.81
SET       6.600        42.04
SET       6.700        43.34
SET       6.800        44.61
SET       6.900        45.94
SET       7.000        47.26
SET       7.100        48.63
SET       7.200        49.99
SET       7.300        51.41
SET       7.400        52.84
SET       7.500        54.32
SET       7.600        55.76
SET       7.700        57.22
SET       7.800        58.69
SET       7.900        60.16
SET       8.000        61.66
SET       8.100        63.11
SET       8.200        64.45
SET       8.300        65.84
SET       8.400        67.28
SET       8.500        68.61
SET       8.600        69.96
SET       8.700        71.18
SET       8.800        72.52
SET       8.900        73.76
SET       9.000        75.07
SET       9.100        76.36
SET       9.200        77.64
SET       9.300        78.92
SET       9.400        80.15
SET       9.500        81.40
SET       9.600        82.68
SET       9.700        83.86
SET       9.800        85.05
SET       9.900        86.17
SET      10.000        90.53
SET      11.000        94.18
SET      12.000        96.02
SET      13.000        97.27
SET      14.000        98.22
SET      15.000        98.84
SET      16.000        99.17
SET      17.000        99.37
SET      18.000        99.48
SET      19.000        99.56
SET      20.000        99.62
SET      21.000        99.66
SET      22.000        99.70
SET      23.000        99.71
SET      24.000        99.73
SET      25.000        99.73
SET      26.000        99.74
SET      27.000        99.75
SET      28.000        99.76
SET      29.000        99.78
SET      30.000        99.79
SET      31.000        99.80
SET      32.000        99.82
SET      33.000        99.84
SET      34.000        99.86
SET      35.000        99.87
SET      36.000        99.90
SET      37.000        99.92
SET      38.000        99.94
SET      39.000        99.95
SET      40.000        99.97
SET      41.000        99.97
SET      42.000        99.97
SET      43.000        99.97
SET      44.000        99.98
SET      49.000        99.98
SET      50.000        99.98
SET      54.000        99.98
SET      55.000        99.98
SET      56.000        99.98
SET      57.000        99.99
SET      58.000        99.99
SET      59.000        99.99
SET      60.000        99.99
SET      61.000        99.99
SET      64.000        99.99
SET     160.000        99.99
SET     170.000       100.00
SET     180.000       100.00
SET     200.000       100.00
SET     210.000       100.00
SET     220.000       100.00
---
---