experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients1_workerthreads16_client1_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       22787 ops,     367 (avg:     325) ops/sec, 1.45MB/sec (avg: 1.28MB/sec),  2.71 (avg:  3.07) msec latency

1         Threads
1         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets         325.53          ---          ---      3.06600      1313.84 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals       325.53         0.00         0.00      3.06600      1313.84 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.630         0.00
SET       0.650         0.01
SET       0.660         0.01
SET       0.670         0.02
SET       0.680         0.03
SET       0.700         0.06
SET       0.710         0.07
SET       0.720         0.08
SET       0.730         0.11
SET       0.740         0.13
SET       0.750         0.19
SET       0.760         0.26
SET       0.770         0.33
SET       0.780         0.39
SET       0.790         0.50
SET       0.800         0.61
SET       0.810         0.79
SET       0.820         0.92
SET       0.830         1.08
SET       0.840         1.29
SET       0.850         1.54
SET       0.860         1.78
SET       0.870         2.05
SET       0.880         2.32
SET       0.890         2.62
SET       0.900         2.96
SET       0.910         3.32
SET       0.920         3.66
SET       0.930         4.06
SET       0.940         4.53
SET       0.950         5.01
SET       0.960         5.56
SET       0.970         6.06
SET       0.980         6.56
SET       0.990         7.06
SET       1.000        10.74
SET       1.100        18.55
SET       1.200        26.97
SET       1.300        34.70
SET       1.400        41.01
SET       1.500        46.23
SET       1.600        50.02
SET       1.700        53.36
SET       1.800        55.89
SET       1.900        57.96
SET       2.000        59.63
SET       2.100        61.10
SET       2.200        62.25
SET       2.300        63.32
SET       2.400        64.12
SET       2.500        64.88
SET       2.600        65.49
SET       2.700        66.09
SET       2.800        66.56
SET       2.900        67.02
SET       3.000        67.42
SET       3.100        67.85
SET       3.200        68.22
SET       3.300        68.58
SET       3.400        68.98
SET       3.500        69.26
SET       3.600        69.57
SET       3.700        69.90
SET       3.800        70.19
SET       3.900        70.54
SET       4.000        70.86
SET       4.100        71.24
SET       4.200        71.62
SET       4.300        72.09
SET       4.400        72.50
SET       4.500        72.98
SET       4.600        73.51
SET       4.700        74.01
SET       4.800        74.52
SET       4.900        75.00
SET       5.000        75.49
SET       5.100        75.98
SET       5.200        76.53
SET       5.300        77.13
SET       5.400        77.64
SET       5.500        78.31
SET       5.600        79.00
SET       5.700        79.56
SET       5.800        80.30
SET       5.900        81.07
SET       6.000        81.84
SET       6.100        82.55
SET       6.200        83.40
SET       6.300        84.25
SET       6.400        85.11
SET       6.500        85.90
SET       6.600        86.72
SET       6.700        87.55
SET       6.800        88.41
SET       6.900        89.33
SET       7.000        90.29
SET       7.100        91.00
SET       7.200        91.71
SET       7.300        92.45
SET       7.400        93.12
SET       7.500        93.73
SET       7.600        94.26
SET       7.700        94.72
SET       7.800        95.05
SET       7.900        95.46
SET       8.000        95.78
SET       8.100        96.02
SET       8.200        96.21
SET       8.300        96.51
SET       8.400        96.69
SET       8.500        96.90
SET       8.600        97.12
SET       8.700        97.27
SET       8.800        97.46
SET       8.900        97.62
SET       9.000        97.72
SET       9.100        97.83
SET       9.200        97.92
SET       9.300        98.00
SET       9.400        98.09
SET       9.500        98.17
SET       9.600        98.24
SET       9.700        98.35
SET       9.800        98.40
SET       9.900        98.46
SET      10.000        98.82
SET      11.000        99.10
SET      12.000        99.32
SET      13.000        99.45
SET      14.000        99.58
SET      15.000        99.77
SET      16.000        99.89
SET      17.000        99.94
SET      18.000        99.96
SET      19.000        99.98
SET      20.000       100.00
SET      40.000       100.00
---
---